<div align="center">
  <br>
  <img src="https://i.ibb.co/DkYw4wF/logo.png" alt="logo" border="0"><br><br>
  МИНОБРНАУКИ РОССИИ<br>
  Федеральное государственное бюджетное<br>
  образовательное учреждение высшего образования
  
#### **«МИРЭА – Российский технологический униврситет»**
  
  Лабораторная работа по дисциплине:<br>
  «Программные средства оперативно-аналитического поиска»
</div>
<br><br><br><br><br>
<div align="right">
  <br>
  Выполнил:<br>
  Студент 4 курса<br>
  Специальности 10.05.05<br>
  Группа ББСО-02-16<br>
  Поляков Д.А.<br>
  Проверил:<br>
  Захарчук И.И.<br>
</div>
<br><br><br><br><br><br><br>

<p align="center">
  Москва 2020
</p>
<br><br><br>

<div align="center">

#### **Лабораторная работа № 2**

</div>

<p>

#### **Цель работы**

Проанализировать сетевые параметры публичных DNS серверов, сделать мотивированный вывод о предпочтительных серверах
</p>

<p>

#### **Исходные данные**


|              Наименование устройства              |    Операционная система    |
| ------------------------------------------------- | -------------------------- |
| MacBook Pro (Retina 13 дюймов, начало 2015 г.)    |    MacOS Catalina 10.15.3  |

</p>

<p>

#### **Исследуемые провайдеры DNS**

1. [Google Public DNS](https://dns.google.com/)<br>
2. [Cloudflare DNS](https://www.cloudflare.com/dns/)<br>
3. [OpenDNS](https://www.opendns.com/)<br>
4. [OnLime DNS](https://onlime.ru/)<br>
</p>

<p>

#### **Используемое ПО **

1. Утилиты traceroute, ping и whois<br>
2. [Rstudio IDE](rstudio.com)
</p>

<p>

#### **Общий план выполнения работы **

1. Используя утилиты tracert/traceroute построить маршрут
2. На основании маршрута, используя утилиту whois узнать местоположение каждого узла маршрута к DNS-серверу, организацию, владеющую каждым узлом маршрута к DNS-серверу
3. Расчитать среднее RTT к DNS-серверу
4. Выделить те узлы маршрута, которые вносят наибольшую временную задержку при передаче
</p>

 


#### **Процесс выполнения работы**

<p>

* **Google Public DNS**

```{r cache=TRUE}

system("traceroute 8.8.8.8", intern = TRUE)

```



|  №  | Первый ping | Второй ping | Третий ping |           Узел         |  Месторасположение |     Организация       | Средняя RTT | Вносит наибольшую временную задержку при передаче |
|:---:|:-----------:|:-----------:|:-----------:|:----------------------:|:------------------:|:---------------------:|:-----------:|:-------------------------------------------------:|
|  1  |     2 ms    |    1 ms     |     1 ms    |     192.168.1.1        |   Москва, Россия   |        Роутер         |      1      |                                                   |               
|  2  |     2 ms    |    10 ms    |     2 ms    |     90.154.77.211      |  Лос-Анджелес, США |         IANA          |     7.3     |                                                   |
|  3  |      *      |    2.5 ms   |     3 ms    |     77.37.250.198      |   Москва, Россия   |      Ростелеком       |      2      |                                                   |
|  4  |     9 ms    |    3 ms     |     3 ms    |     77.37.250.249      |   Москва, Россия   |      Ростелеком       |      5      |                                                   |
|  5  |     9 ms    |    3 ms     |     3 ms    |     72.14.209.81       |  Маунтин-Вью, США  |      Google LLC       |      5      |                                                   |
|  6  |    11 ms    |    5 ms     |     3 ms    |    108.170.250.149     |  Маунтин-Вью, США  |      Google LLC       |     6,3     |                                                   |
|  7  |    19 ms    |   20 ms     |    21 ms    |    209.85.249.158      |  Маунтин-Вью, США  |      Google LLC       |     20      |                      Да                           |
|  8  |    18 ms    |   18 ms     |    22 ms    |    209.85.254.6        |  Маунтин-Вью, США  |      Google LLC       |    19,3     |                      Да                           |   
|  9  |    22 ms    |   25 ms     |    20 ms    |    172.253.51.219      |  Маунтин-Вью, США  |      Google LLC       |    22,3     |                      Да                           |
| 10  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |             
| 11  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |  
| 12  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |
| 13  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |  
| 14  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |  
| 15  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |  
| 16  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |  
| 17  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |   
| 18  |      *      |     *       |      *      |   Request timed out.   |                    |                       |             |                                                   |   
| 19  |   19 ms     |     *       |    27 ms    |  dns.google (8.8.8.8)  |   Нью-Йорк, США    |      Google LLC       |      23     |                      Да                           |

</p>


<p>

* **Cloudflare DNS**

```{r cache=TRUE}
system("traceroute 1.1.1.1", intern = TRUE)
```

|  №  | Первый ping | Второй ping | Третий ping |                          Узел                           |    Месторасположение    |           Организация          | Средняя RTT | Вносит наибольшую временную задержку при передаче |
|:---:|:-----------:|:-----------:|:-----------:|:-------------------------------------------------------:|:-----------------------:|:------------------------------:|:-----------:|:--------------------------------------------------|
|  1  |     2 ms    |    1 ms     |     1 ms    |                        192.168.1.1                      |     Москва, Россия      |             Роутер             |     1,3     |                                                   |
|  2  |     2 ms    |    7 ms     |     8 ms    |                       90.154.77.211                     |   Лос-Анджелес, США     |              IANA              |     5,6     |                                                   |
|  3  |     2 ms    |    3 ms     |     2 ms    |                       77.37.250.198                     |     Москва, Россия      |           Ростелеком           |     2,3     |                                                   |
|  4  |     6 ms    |     *       |      *      |                       188.254.25.75                     |     Москва, Россия      |           Ростелеком           |      6      |                                                   |
|  5  |     5 ms    |    3 ms     |    19 ms    |                       213.59.211.237                    |     Москва, Россия      |           Ростелеком           |      9      |                                                   |
|  6  |    20 ms    |   20 ms     |    25 ms    |    rostel-gw.ip4.gtt.net (77.67.90.97)                  |  Ной-Изенбург, Германия |   Tinet International Network  |    21,6     |                      Да                           |
|  7  |    23 ms    |   21 ms     |    20 ms    |    ae1-500.cr1-stk3.ip4.gtt.net (77.67.90.96)           |  Ной-Изенбург, Германия |   Tinet International Network  |    21.6     |                      Да                           |
|  8  |    28 ms    |   23 ms     |    29 ms    |    cloudflare-gw.cr0-stk3.ip4.gtt.net (141.136.101.178) |  Ной-Изенбург, Германия |   Tinet International Network  |    26.6     |                      Да                           |  
|  9  |    22 ms    |   23 ms     |    20 ms    |    one.one.one.one (1.1.1.1)                            |  Брисбен, Австралия     |         Cloudflare DNS         |    21.6     |                      Да                           |

</p>

<p>

* **OpenDNS**

```{r cache=TRUE}

system("traceroute 208.67.220.220", intern = TRUE)

```





|  №  | Первый ping | Второй ping | Третий ping |                           Узел                          |    Месторасположение    |           Организация          | Средняя RTT | Вносит наибольшую временную задержку при передаче |
|:---:|:-----------:|:-----------:|:-----------:|:-------------------------------------------------------:|:-----------------------:|:------------------------------:|:-----------:|:-------------------------------------------------:|
|  1  |     76 ms   |    1 ms     |     1 ms    |                        192.168.1.1                      |      Москва, Россия     |             Роутер             |      26     |                       Да                          |              
|  2  |      3 ms   |    3 ms     |     3 ms    |                       90.154.77.211                     |    Лос-Анджелес, США    |              IANA              |      3      |                                                   |
|  3  |       *     |      *      |      *      |                     Request timed out.                  |                         |                                |             |                                                   |
|  4  |     13 ms   |   13 ms     |     2 ms    |                       87.226.221.70                     |      Москва, Россия     |           Ростелеком           |     9.3     |                                                   |
|  5  |     26 ms   |   21 ms     |    28 ms    |   ae46.stkm-cr4.intl.ip.rostelecom.ru (87.226.133.133)  |      Москва, Россия     |           Ростелеком           |      25     |                       Да                          |
|  6  |     26 ms   |   24 ms     |    25 ms    |         ae1-500.cr1-stk3.ip4.gtt.net (77.67.90.96)      |  Ной-Изенбург, Германия |   Tinet International Network  |      25     |                       Да                          |
|  7  |     59 ms   |   47 ms     |    51 ms    |         ae13.cr5-ams1.ip4.gtt.net (213.200.117.202)     |  Ной-Изенбург, Германия |   Tinet International Network  |    52.3     |                       Да                          |
|  8  |     47 ms   |      *      |    52 ms    |           opendns-gw.ip4.gtt.net (77.67.66.70)          |  Ной-Изенбург, Германия |   Tinet International Network  |    49.5     |                       Да                          |   
|  9  |       *     |   61 ms     |   124 ms    |          resolver2.opendns.com (208.67.220.220)         |    Сан-Франциско, США   |        Cisco OpenDNS LLC       |    92.5     |                       Да                          |

</p>

<p>

* **OnLime DNS**

```{r cache=TRUE}

system("traceroute 213.158.0.6", intern = TRUE)

```

|  №  | Первый ping | Второй ping | Третий ping |           Узел         |  Месторасположение |     Организация       | Средняя RTT | Вносит наибольшую временную задержку при передаче |
|:---:|:-----------:|:-----------:|:-----------:|:----------------------:|:------------------:|:---------------------:|:-----------:|:-------------------------------------------------:|
|  1  |     3 ms    |    16 ms    |     1 ms    |       192.168.1.1      |   Москва, Россия   |        Роутер         |     6.6     |                                                   |                         
|  2  |     2 ms    |    2 ms     |     2 ms    |      90.154.77.211     |  Лос-Анджелес, США |         IANA          |      2      |                                                   |
|  3  |      *      |     *       |      *      |    Request timed out.  |                    |                       |             |                                                   |
|  4  |     5 ms    |    4 ms     |     4 ms    |      87.226.221.170    |   Москва, Россия   |      Ростелеком       |     4,3     |                                                   |     
|  5  |    34 ms    |   13 ms     |    14 ms    |      212.48.194.29     |   Москва, Россия   |      Ростелеком       |    20,3     |                        Да                         |
|  6  |    16 ms    |   14 ms     |    14 ms    |       213.158.0.6      |   Москва, Россия   |      Ростелеком       |    14,6     |                        Да                         |

</p>

<p>

* **Cравнительную диаграмму RTT к серверам**

Используемые цвета:

1.	Google DNS - Золотой
2.	Сloudflare DNS - Синий
3.	OpenDNS - Красный
4.  OnLime DNS - Зелёный


```{r, echo=FALSE}
x <- c(0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100)
y <- c(0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50)
x_google <- c(1,7.3,2,5,5,6.3,20,19.3,22.3,23)
y_google <- c(1,2,3,4,5,6,7,8,9,10)
x_cloudflare <- c(1.3,5.6,2.3,6,9,21.6,21.6,26.6,21.6)
y_cloudflare <- c(1,2,3,4,5,6,7,8,9)
x_opendns <- c(26,3,9.3,25,25,52.3,49.5,92.5)
y_opendns <- c(1,2,3,4,5,6,7,8)
x_onlime <- c(6.6,2,4.3,20.3,14.6)
y_onlime <- c(1,2,3,4,5)


plot(y,x,main = "RTT comparison chart for servers", xlab = "Step", ylab = "RTT",type = "n")
points(y_google,x_google, col = "goldenrod")
lines(y_google,x_google, col = "goldenrod")
points(y_cloudflare,x_cloudflare, col = "MediumBlue")
lines(y_cloudflare,x_cloudflare, col = "MediumBlue")
points(y_opendns,x_opendns, col = "IndianRed")
lines(y_opendns,x_opendns, col = "IndianRed")
points(y_onlime,x_onlime, col = "green")
lines(y_onlime,x_onlime, col = "green")

```

<img src="https://i.ibb.co/Mg9XQm9/unnamed-chunk-5-1.png" border="0">


</p>

<p>

#### **Оценка результата** 

По полученным в ходе лабораторной работы данным, можно сделать вывод что самое минимальное время было затрачено на обращение к OnLime DNS, а максимальное к OpenDNS.

</p>

<p>

#### **Вывод**

В данной лабораторной работе я проанализировал сетевые параметры публичных DNS серверов
</p>

